ELPasEDT/src/Documents/ЗаписьЖурналаУчетаРеагентов/ЗаписьЖурналаУчетаРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьЖурналаУчетаРеагентов</name>
  <registerRecords>InformationRegister.РаботаХимцеха</registerRecords>
  <registerRecords>AccumulationRegister.ИспользованиеРеагентов</registerRecords>
  <registerRecords>AccumulationRegister.РеагентыВПодразделениях</registerRecords>
  <registerRecords>InformationRegister.УровеньРаствораВМернике</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаНачалаЗакачки</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаНачалаРасхода</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаОкончанияЗакачки</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВахтаОкончанияРасхода</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЗакачки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЗакачки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий3</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий4</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаНачалоЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаНачалоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаОкончаниеЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияНаОкончаниеРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонцентрацияПоДокументам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемСработанногоРаствораЗакачка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемСработанногоРаствораРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйНачалаЗакачки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйНачалаРасхода</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОкончанияЗакачки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйОкончанияРасхода</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлотностьПоТаблицам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасходТоварногоРеагента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаНачалаЗакачки</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаНачалаРасхода</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаОкончанияЗакачки</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаОкончанияРасхода</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаНачалоЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаНачалоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаОкончаниеЗакачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньНаОкончаниеРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКоличества</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКонцентрации</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПлотности</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходРеагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасхода</name>
    <type>
      <types>CatalogRef.ВидыРасходаРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеРасхода</name>
    <type>
      <types>CatalogRef.НаправленияРасходаРеагентов</types>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакачкаНачата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакачкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходНачат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитатьРасходВоВремяЗакачки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЧистогоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЧистогоРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЧистойЗакачки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияЧистогоРасхода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВЖурнал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПриемаСмены</name>
    <type>
      <types>DocumentRef.ОперативныйЖурнал</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийАвтрораИзменений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Корректировки</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/InformationRegisters/ОборудованиеХимЦеха/ОборудованиеХимЦеха.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОборудованиеХимЦеха</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КонтрольМаксЗначениеКонцентрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольМаксЗначениеУровня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольМинЗначениеКонцентрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольМинЗначениеУровня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ОстановкаОборудованияНаГраницеСменыИлиПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлощадьОснования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>РасходИЗакачкаОдновременно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеОборудования</name>
    <type>
      <types>EnumRef.СостоянияОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьСостояниеВИнформационнойПанелиАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СообщающиесяСосуды</name>
    <type>
      <types>CatalogRef.СообщающиесяСосуды</types>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/Enums/РассчетныеПоказателиЖурналаУчетаРеагентов/РассчетныеПоказателиЖурналаУчетаРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РассчетныеПоказателиЖурналаУчетаРеагентов</name>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>РасходТоварногоРеагента</name>
  </enumValues>
</mdclass:Enum>

ELPasEDT/src/Catalogs/ФормулыПоказателейЖурналаУчетаРеагентов/ФормулыПоказателейЖурналаУчетаРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФормулыПоказателейЖурналаУчетаРеагентов</name>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>EnumRef.РассчетныеПоказателиЖурналаУчетаРеагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Реагенты</name>
    <attributes>
      <name>Реагент</name>
      <type>
        <types>EnumRef.ВидыРеагентов</types>
        <types>CatalogRef.Реагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ELPasEDT/src/Documents/ЗаписьЖурналаУчетаРеагентов/ManagerModule.bsl
Функция ПолучитьИменаПолейТаблицыЖурнала(МестоВТаблице) Экспорт
	
	ИменаПолей = Новый Структура("
		|Дата,
		|Уровень,
		|Концентрация,		
		|Ответственный,
		|Смена,
		|Вахта,
		|Комментарий");
	
	МестоЗаписиВТаблице = Новый Структура;
	МестоЗаписиВТаблице.Вставить("НачалоЗакачки"   , 1);
	МестоЗаписиВТаблице.Вставить("ОкончаниеЗакачки", 2);
	МестоЗаписиВТаблице.Вставить("НачалоРасхода"   , 3);
	МестоЗаписиВТаблице.Вставить("ОкончаниеРасхода", 4);
	
	ИменаПолей.Комментарий = "Комментарий" + МестоВТаблице;
	Если МестоВТаблице = МестоЗаписиВТаблице.НачалоЗакачки Тогда
		ИменаПолей.Дата          = "ДатаНачалаЗакачки";
		ИменаПолей.Уровень       = "УровеньНаНачалоЗакачки";
		ИменаПолей.Концентрация  = "КонцентрацияНаНачалоЗакачки";		
		ИменаПолей.Ответственный = "ОтветственныйНачалаЗакачки";
		ИменаПолей.Смена         = "СменаНачалаЗакачки";
		ИменаПолей.Вахта         = "ВахтаНачалаЗакачки";
	ИначеЕсли МестоВТаблице = МестоЗаписиВТаблице.ОкончаниеЗакачки Тогда
		ИменаПолей.Дата          = "ДатаОкончанияЗакачки";
		ИменаПолей.Уровень       = "УровеньНаОкончаниеЗакачки";
		ИменаПолей.Концентрация  = "КонцентрацияНаОкончаниеЗакачки";
		ИменаПолей.Ответственный = "ОтветственныйОкончанияЗакачки";
		ИменаПолей.Смена         = "СменаОкончанияЗакачки";
		ИменаПолей.Вахта         = "ВахтаОкончанияЗакачки";
	ИначеЕсли МестоВТаблице = МестоЗаписиВТаблице.НачалоРасхода Тогда
		ИменаПолей.Дата          = "ДатаНачалаРасхода";
		ИменаПолей.Уровень       = "УровеньНаНачалоРасхода";
		ИменаПолей.Концентрация  = "КонцентрацияНаНачалоРасхода";
		ИменаПолей.Ответственный = "ОтветственныйНачалаРасхода";
		ИменаПолей.Смена         = "СменаНачалаРасхода";
		ИменаПолей.Вахта         = "ВахтаНачалаРасхода";
	ИначеЕсли МестоВТаблице = МестоЗаписиВТаблице.ОкончаниеРасхода Тогда
		ИменаПолей.Дата          = "ДатаОкончанияРасхода";
		ИменаПолей.Уровень       = "УровеньНаОкончаниеРасхода";
		ИменаПолей.Концентрация  = "КонцентрацияНаОкончаниеРасхода";
		ИменаПолей.Ответственный = "ОтветственныйОкончанияРасхода";
		ИменаПолей.Смена         = "СменаОкончанияРасхода";
		ИменаПолей.Вахта         = "ВахтаОкончанияРасхода";
	КонецЕсли;
	
	Возврат ИменаПолей;
	
КонецФункции

Функция ЗаполнитьРасчетныеПоказателиСтрокиЖурнала(СтрокаТаблицыЖурнала, ПараметрыОборудования = Неопределено) Экспорт
	
	Если ПараметрыОборудования = Неопределено Тогда
		Отказ = Ложь;
		ПараметрыОборудования = РегистрыСведений.ОборудованиеХимЦеха.ПолучитьПараметрыОборудования
			(СтрокаТаблицыЖурнала.Дата, СтрокаТаблицыЖурнала.Оборудование, Отказ);
	КонецЕсли;
	
	РассчитатьЗакачку = СтрокаТаблицыЖурнала.РассчитатьРасходВоВремяЗакачки;
	РассчитатьРасход  = СтрокаТаблицыЖурнала.РасходЗавершен Или СтрокаТаблицыЖурнала.РасходОтсечкаВремени;
	
	СтрокаТаблицыЖурнала.ВремяЗакачки = 0;
	СтрокаТаблицыЖурнала.ВремяРасхода = 0;
	СтрокаТаблицыЖурнала.ОбъемСработанногоРаствораРасход  = 0;
	СтрокаТаблицыЖурнала.ОбъемСработанногоРаствораЗакачка = 0;
	
	ДатаНачалаЗакачки = СтрокаТаблицыЖурнала.ДатаНачалаЗакачки;			
	ДатаНачалаРасхода = СтрокаТаблицыЖурнала.ДатаНачалаРасхода;
		
	Если РассчитатьРасход И ЗначениеЗаполнено(ДатаНачалаРасхода) Тогда	
		СтрокаТаблицыЖурнала.ВремяРасхода = 
			(СтрокаТаблицыЖурнала.ДатаОкончанияРасхода - ДатаНачалаРасхода) / 60; // Секунды в минуты
		СтрокаТаблицыЖурнала.ОбъемСработанногоРаствораРасход = 
				ПараметрыОборудования.ПлощадьОснования * (СтрокаТаблицыЖурнала.УровеньНаНачалоРасхода - СтрокаТаблицыЖурнала.УровеньНаОкончаниеРасхода);
			КонецЕсли;
			
	// Объем реагента, израсходованного в процессе закачки
	Если РассчитатьЗакачку Тогда
		
		СтрокаТаблицыЖурнала.ВремяЗакачки =
			(СтрокаТаблицыЖурнала.ДатаОкончанияЗакачки - ДатаНачалаЗакачки) / 60; // Секунды в минуты
			
				
		Если СтрокаТаблицыЖурнала.ОбъемСработанногоРаствораРасход <> 0 И СтрокаТаблицыЖурнала.ВремяРасхода <> 0 Тогда
			СкоростьРасхода = СтрокаТаблицыЖурнала.ОбъемСработанногоРаствораРасход / СтрокаТаблицыЖурнала.ВремяРасхода;
		Иначе
			СкоростьРасхода = ПолучитьСкоростьРасхода(СтрокаТаблицыЖурнала.Оборудование, СтрокаТаблицыЖурнала.Дата);
		КонецЕсли;
		
		СтрокаТаблицыЖурнала.ОбъемСработанногоРаствораЗакачка =
			СкоростьРасхода * СтрокаТаблицыЖурнала.ВремяЗакачки;
		
	КонецЕсли;		
			
	///////////////////////////////////////////////////////////////////////////////
	// Итоги
	
	Расшифровка = "";
	
	Плотность = СтрокаТаблицыЖурнала.ПлотностьПоТаблицам;
	
	ДобавитьПоказательВРасшифровку(Расшифровка, "Расход =");
	
	СтрокаТаблицыЖурнала.Расход = РассчитатьПоФормуле(Перечисления.РассчетныеПоказателиЖурналаУчетаРеагентов.Расход,
		СтрокаТаблицыЖурнала.Реагент,
		СтрокаТаблицыЖурнала.Оборудование.Организация,
		СтрокаТаблицыЖурнала.ОбъемСработанногоРаствораЗакачка,
		СтрокаТаблицыЖурнала.ОбъемСработанногоРаствораРасход,
		Макс(СтрокаТаблицыЖурнала.КонцентрацияНаНачалоЗакачки, СтрокаТаблицыЖурнала.КонцентрацияНаОкончаниеРасхода),
		Плотность, // плотность
		СтрокаТаблицыЖурнала.Партия, // партия
		СтрокаТаблицыЖурнала.Расход, // расход100
		СтрокаТаблицыЖурнала.ЕдиницаИзмеренияКонцентрации, // е.и. конц
		СтрокаТаблицыЖурнала.ЕдиницаИзмеренияКоличества,  // е.и. колич
		СтрокаТаблицыЖурнала.ЕдиницаИзмеренияПлотности,
		Расшифровка);
		
	ДобавитьПоказательВРасшифровку(Расшифровка, "РасходТоварногоРеагента =");	
		
	СтрокаТаблицыЖурнала.РасходТоварногоРеагента = РассчитатьПоФормуле(Перечисления.РассчетныеПоказателиЖурналаУчетаРеагентов.РасходТоварногоРеагента,
		СтрокаТаблицыЖурнала.Реагент,
		СтрокаТаблицыЖурнала.Оборудование.Организация,
		СтрокаТаблицыЖурнала.ОбъемСработанногоРаствораЗакачка,
		СтрокаТаблицыЖурнала.ОбъемСработанногоРаствораРасход,
		Макс(СтрокаТаблицыЖурнала.КонцентрацияНаНачалоЗакачки, СтрокаТаблицыЖурнала.КонцентрацияНаОкончаниеРасхода),
		Плотность, // плотность
		СтрокаТаблицыЖурнала.Партия, // партия
		СтрокаТаблицыЖурнала.Расход, // расход100
		СтрокаТаблицыЖурнала.ЕдиницаИзмеренияКонцентрации, // е.и. конц
		СтрокаТаблицыЖурнала.ЕдиницаИзмеренияКоличества,  // е.и. колич
		СтрокаТаблицыЖурнала.ЕдиницаИзмеренияПлотности,
		Расшифровка);
		
	Возврат Расшифровка;	
		
КонецФункции

Функция ПолучитьСкоростьРасхода(Оборудование, Дата)
	
	Скорость = 0;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА ЗаписьЖурналаУчетаРеагентов.ВремяРасхода <> 0
	|			ТОГДА ЗаписьЖурналаУчетаРеагентов.ОбъемСработанногоРаствораРасход / ЗаписьЖурналаУчетаРеагентов.ВремяРасхода
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СкоростьРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаписьЖурналаУчетаРеагентов КАК ЗаписьЖурналаУчетаРеагентов
	|ГДЕ
	|	ЗаписьЖурналаУчетаРеагентов.ВремяРасхода <> 0
	|	И ЗаписьЖурналаУчетаРеагентов.ОбъемСработанногоРаствораРасход <> 0
	|	И ЗаписьЖурналаУчетаРеагентов.Проведен
	|	И НЕ ЗаписьЖурналаУчетаРеагентов.ЗаписьОтменена
	|	И ЗаписьЖурналаУчетаРеагентов.Оборудование = &Оборудование
	|	И ЗаписьЖурналаУчетаРеагентов.Дата <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Скорость = Выборка.СкоростьРасхода;
	КонецЕсли;
	
	Возврат Скорость;
	
КонецФункции

Функция ПолучитьИнтервалРасходаТекДокумента(СтрокаТаблицыЖурнала)
	
	Интервал = Новый Структура;
	Интервал.Вставить("ДатаНачалаРасхода",    '00010101');
	Интервал.Вставить("ДатаОкончанияРасхода", '00010101');
	
	Если СтрокаТаблицыЖурнала.РасходНачат И СтрокаТаблицыЖурнала.РасходЗавершен 
		И ЗначениеЗаполнено(СтрокаТаблицыЖурнала.ДатаНачалаРасхода) И ЗначениеЗаполнено(СтрокаТаблицыЖурнала.ДатаОкончанияРасхода)
		Тогда
		
		Интервал.ДатаНачалаРасхода    = СтрокаТаблицыЖурнала.ДатаНачалаРасхода;
		Интервал.ДатаОкончанияРасхода = СтрокаТаблицыЖурнала.ДатаОкончанияРасхода;
	КонецЕсли;
	
	Возврат Интервал;
	
КонецФункции

Функция ПолучитьИнтервалЗакачкиТекДокумента(СтрокаТаблицыЖурнала)
	
	Интервал = Новый Структура;
	Интервал.Вставить("ДатаНачалаЗакачки",    '00010101');
	Интервал.Вставить("ДатаОкончанияЗакачки", '00010101');
	
	Если СтрокаТаблицыЖурнала.ЗакачкаНачата И СтрокаТаблицыЖурнала.ЗакачкаЗавершена 
		И ЗначениеЗаполнено(СтрокаТаблицыЖурнала.ДатаНачалаЗакачки) И ЗначениеЗаполнено(СтрокаТаблицыЖурнала.ДатаОкончанияРасхода)
		Тогда
		
		Интервал.ДатаНачалаЗакачки    = СтрокаТаблицыЖурнала.ДатаНачалаЗакачки;
		Интервал.ДатаОкончанияЗакачки = СтрокаТаблицыЖурнала.ДатаОкончанияЗакачки;
	КонецЕсли;
	
	Возврат Интервал;
	
КонецФункции

Функция СтруктураЗаполнена(Структура)
	
	Заполнена = Истина;
	
	Если Структура.Количество() = 0 Тогда
		Заполнена = Ложь;
	Иначе
		Для Каждого Элемент Из Структура Цикл
			Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
				Заполнена = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Заполнена;
	
КонецФункции

Функция ПолучитьИнтервалОперации(Операция, Дата)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РаботаХимцехаСрезПоследних.Период КАК Период,
	|	РаботаХимцехаСрезПоследних.Включено КАК Включено
	|ИЗ
	|	РегистрСведений.РаботаХимцеха.СрезПоследних(
	|			&Дата,
	|			Оборудование = &Оборудование
	|				И ВидЗаписи = &ВидЗаписи) КАК РаботаХимцехаСрезПоследних");
	
КонецФункции

Функция ПолучитьЧистыйРасход(СтрокаТаблицыЖурнала)
	
	ДатаНачалаЗакачки    = '00010101';
	ДатаОкончанияЗакачки = '00010101';
	ДатаНачалаРасхода    = '00010101';
	ДатаОкончанияРасхода = '00010101';
	
	Если СтрокаТаблицыЖурнала.РасходНачат И ЗначениеЗаполнено(СтрокаТаблицыЖурнала.ДатаНачалаРасхода) Тогда
		ДатаНачалаРасхода = СтрокаТаблицыЖурнала.ДатаНачалаРасхода;
	Иначе
		ДатаНачалаРасхода = ДатаСостоянияПроцесса();
	КонецЕсли;
	
	Если СтрокаТаблицыЖурнала.РасходНачат И ЗначениеЗаполнено(СтрокаТаблицыЖурнала.ДатаОкончанияРасхода) Тогда
		ДатаОкончанияРасхода = СтрокаТаблицыЖурнала.ДатаОкончанияРасхода;
	Иначе
		ДатаОкончанияРасхода = ДатаСостоянияПроцесса();
	КонецЕсли;
	
	
	
	Если СтрокаТаблицыЖурнала.РасходНачат И ЗначениеЗаполнено(СтрокаТаблицыЖурнала.ДатаНачалаРасхода)
		И СтрокаТаблицыЖурнала.РасходЗавершен И ЗначениеЗаполнено(СтрокаТаблицыЖурнала.ДатаОкончанияРасхода)
		И СтрокаТаблицыЖурнала.ЗакачкаНачата И ЗначениеЗаполнено(СтрокаТаблицыЖурнала.ДатаНачалаЗакачки)
		И СтрокаТаблицыЖурнала.ЗакачкаЗавершена И ЗначениеЗаполнено(СтрокаТаблицыЖурнала.ДатаОкончанияЗакачки) Тогда
		
		
		
	КонецЕсли;
	
	//
	//Если
	//
	//СтрокаТаблицыЖурнала.ВремяЗакачки =
	//		(СтрокаТаблицыЖурнала.ДатаОкончанияЗакачки - ДатаНачалаЗакачки) / 60; // Секунды в минуты
	
КонецФункции

Функция ДатаСостоянияПроцесса()
	
КонецФункции

Процедура ДобавитьПоказательВРасшифровку(Расшифровка, Показатель)
	
	Расшифровка = Расшифровка + Показатель;
	
КонецПроцедуры

Функция РазобратьСтроку(Строка, Разделитель)

	ДлинаСтроки = СтрДлина(Строка);
	Значения    = Новый Массив;
	ТекЗначение = "";
	
	Для Инд = 1 По ДлинаСтроки Цикл
		
		ТекСимвол = Сред(Строка, Инд, 1);
		
		Если СтрНайти(Разделитель, ТекСимвол) Тогда
			Значения.Добавить(ТекЗначение);
			ТекЗначение = "";
		Иначе
			ТекЗначение = ТекЗначение + ТекСимвол;
		КонецЕсли;
		
	КонецЦикла;
	
	Значения.Добавить(ТекЗначение); // добавим крайний элемент
	
	Возврат Значения;
	
КонецФункции

Функция РассчитатьПоФормуле(Показатель, 
	Реагент,
	Организация,
	
	ОбъемСработанногоРаствораЗакачка = Неопределено,
	ОбъемСработанногоРаствораРасход  = Неопределено,
	Концентрация                     = Неопределено,
	Плотность                        = Неопределено,
	
	Партия                           = Неопределено,
	Расход100                        = Неопределено,
	
	ЕдиницаИзмеренияКонцентрации     = Неопределено,
	ЕдиницаИзмеренияКоличества       = Неопределено,
	ЕдиницаИзмеренияПлотности        = Неопределено,
	
	Расшифровка = "") Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ФормулыПоказателейЖурналаУчетаРеагентовРеагенты.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ФормулыПоказателейЖурналаУчетаРеагентовРеагенты.Реагент = &Реагент
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет,
	|	ФормулыПоказателейЖурналаУчетаРеагентовРеагенты.Ссылка.Формула КАК Формула
	|ИЗ
	|	Справочник.ФормулыПоказателейЖурналаУчетаРеагентов.Реагенты КАК ФормулыПоказателейЖурналаУчетаРеагентовРеагенты
	|ГДЕ
	|	(ФормулыПоказателейЖурналаУчетаРеагентовРеагенты.Реагент = &ВидРеагента
	|			ИЛИ ФормулыПоказателейЖурналаУчетаРеагентовРеагенты.Реагент = &Реагент)
	|	И НЕ ФормулыПоказателейЖурналаУчетаРеагентовРеагенты.Ссылка.ПометкаУдаления
	|	И ФормулыПоказателейЖурналаУчетаРеагентовРеагенты.Ссылка.Показатель = &Показатель
	|	И ФормулыПоказателейЖурналаУчетаРеагентовРеагенты.Ссылка.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	Запрос.УстановитьПараметр("Показатель", Показатель);
	Запрос.УстановитьПараметр("ВидРеагента", Реагент.ВидРеагента);
	Запрос.УстановитьПараметр("Реагент", Реагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	
		Попытка
			Результат = Вычислить(Выборка.Формула);
		Исключение
			Сообщить(ОписаниеОшибки());
			Результат = 0;
		КонецПопытки;
		
	КонецЕсли;
	
	// Подгогтовка расшифровкм
	
	Расшифровка = Расшифровка + Результат;
	
	ПараметрыФормулы = РазобратьСтроку(Выборка.Формула, " */-+()?,
	|");
	
	Расшифровка = Расшифровка + "
	|" + Выборка.Формула + "
	|";
	
	
	Для Каждого ПараметрФормулы Из ПараметрыФормулы Цикл
		
		Попытка
			
			Значение = Вычислить(ПараметрФормулы);
			Расшифровка = Расшифровка + "
			|" + ПараметрФормулы + "=" + Значение;
			
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
	
	Расшифровка = Расшифровка + "
	|
	|";
	
	Возврат Результат;
	
КонецФункции
